artillery-tests/first-test.yml
config:
  target: "http://asciiart.artillery.io:8080"
  phases:
    - duration:
      arrivalRate:
      rampTo: 5
      name: Warm up
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
        - get:
            url: "/dino"
        - get:
            url: "/pony"
        - get:
            url: "/armadillo"
        count: 100