artillery-tests/load-phases.yml
config:
  target: "http://asciiart.artillery.io:8080"
  phases:
    - duration: 60
      arrivalRate: 5
     # maxVusers: 5
      name: Constant arrival
    - duration: 180
      arrivalRate: 10
      rampTo: 50
      name: Ramp up to specified load
    - duration: 60
      arrivalCount: 20
      name: Fixed arrival for this duration
    - pause: 20
      name: Pause for this duration
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
        - get:
            url: "/dino"
        - get:
            url: "/pony"
        - get:
            url: "/armadillo"
        count: 100